#include "object.h"

////////////////////////////////////////////////////////////////////////////////
/// \brief Конструктор по умолчанию
Object::Object()
{

}

////////////////////////////////////////////////////////////////////////////////
/// \brief Деструктор
Object::~Object()
{
}

////////////////////////////////////////////////////////////////////////////////
/// \brief Установить название объекта
/// \param Name название объекта
void Object::setName(std::string Name)
{
	this->Name = Name;
}

////////////////////////////////////////////////////////////////////////////////
/// \brief Установить идентификационный номер объекта
/// \param ID идентификационный номер объекта
void Object::setID(int ID)
{
	this->ID = ID;
}

////////////////////////////////////////////////////////////////////////////////
/// \brief Установить идентификационный номер группы объекта
/// \param IDGroup идентификационный номер группы объекта
void Object::setIDGroup(int IDGroup)
{
	this->IDGroup = IDGroup;
}

////////////////////////////////////////////////////////////////////////////////
/// \brief Установить идентификационный номер объекта в группе
/// \param IDInGroup идентификационный номер объекта в группе
void Object::setIDInGroup(int IDInGroup)
{
	this->IDInGroup = IDInGroup;
}

////////////////////////////////////////////////////////////////////////////////
/// \brief Установить идентификационный номер команды
/// \param IDTEAM идентификационный номер команды
void Object::setIDTeam(IDTeam IDTEAM)
{
	this->IDTEAM = IDTEAM;
}

////////////////////////////////////////////////////////////////////////////////
/// \brief Установить первичные данные об объекте
/// \param Name			название объекта
/// \param IDGroup		идентификационный номер группы объекта
/// \param IDInGroup	идентификационный номер объекта в группе
/// \param IDTEAM		идентификационный номер команды
void Object::setInfo(std::string Name, int IDGroup, int IDInGroup,IDTeam IDTEAM)
{
	setName			(Name);
	setID			(IDGroup + IDInGroup);
	setIDGroup		(IDGroup);
	setIDInGroup	(IDInGroup);
	setIDTeam		(IDTEAM);
}

////////////////////////////////////////////////////////////////////////////////
/// \brief Получить название объекта
/// \return Название объекта
std::string Object::getName()
{
	return this->Name;
}

////////////////////////////////////////////////////////////////////////////////
/// \brief Получить идентификационный номер объекта
/// \return Идентификационный номер объекта
int Object::getID()
{
	return this->ID;
}

////////////////////////////////////////////////////////////////////////////////
/// \brief Получить идентификационный номер группы объекта
/// \return Идентификационный номер группы объекта
int Object::getIDGroup()
{
	return this->IDGroup;
}

////////////////////////////////////////////////////////////////////////////////
/// \brief Получить идентификационный номер объекта в группе
/// \return Идентификационный номер объекта в группе
int Object::getIDInGroup()
{
	return this->IDInGroup;
}

////////////////////////////////////////////////////////////////////////////////
/// \brief Получить идентификационный номер команды
/// \return Идентификационный номер команды
IDTeam Object::getIDTeam()
{
	return this->IDTEAM;
}

////////////////////////////////////////////////////////////////////////////////
/// \brief Функция вывода информации о объекте
void Object::toShowInfo ()
{
	std::cout<< "________________________________________________"<< std::endl;
	std::cout<< "Name:		"	<< Name			<<	std::endl;
	std::cout<< "IDGroup:	"	<< IDGroup		<<	std::endl;
	std::cout<< "IDInGroup:	"	<< IDInGroup	<<	std::endl;
}

////////////////////////////////////////////////////////////////////////////////
/// \brief Обновление объекта
void Object::Update()
{

}
