#include "spice.h"

////////////////////////////////////////////////////////////////////////////////
/// \brief Конструктор по умолчанию
Spice::Spice()
{

}

////////////////////////////////////////////////////////////////////////////////
/// \brief Конструктор с параметрами
/// \param NumSpice		текущее значение ресурса
/// \param MaxNumSpice	максимальное значение ресурса
/// \param IDTEAM идентификационный номер команды
Spice::Spice(int NumSpice, int MaxNumSpice, IDTeam IDTEAM)
{
	setInfo ("Спайс", 50, 1, IDTEAM);
	setInfoRes (NumSpice,MaxNumSpice);
}

////////////////////////////////////////////////////////////////////////////////
/// \brief Деструктор
Spice::~Spice()
{
}
